Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Members beyond the second are at the offset of the previous member plus the size of the previous member.
ja: 2番目以降のメンバーは、前のメンバーのオフセットにサイズを足したものになります。

source: Memory could not be allocated within the process which owns the status bar.
ja: ステータス・バーを所有するプロセス内でメモリが割り当てられなかった。

source: Menu (use the Menu/MenuBar class, TraySetIcon, A_IconTip, A_IconHidden and A_AllowMainWindow)
ja: Menu（Menu/MenuBarクラス、TraySetIcon、A_IconTip、A_IconHidden、A_AllowMainWindowを使用します）

source: Menu and Gui had this mode as well but were replaced with objects (which do not use ErrorLevel).
ja: MenuとGuiにもこのモードがありましたが、オブジェクト（ErrorLevelを使用しない）に変更されました。

source: Menu objects are used to define, modify and display popup menus.
ja: メニューオブジェクトは、ポップアップメニューの定義、変更、表示に使用します。

source: Menu separator lines count as menu items for the purpose of determining the position of a menu item.
ja: メニューの区切り線は、メニューの位置を決定するためのメニュー項目としてカウントされます。

source: Menu/MenuBar Object
ja: Menu/MenuBarオブジェクト

source: Menu/MenuBar Object - Methods & Properties | AutoHotkey v2
ja: Menu/MenuBarオブジェクト - メソッドとプロパティ｜AutoHotkey v2

source: MenuBar objects are used to define and modify menu bars for use with Gui.MenuBar.
ja: MenuBarオブジェクトは、Gui.MenuBarで使用するメニューバーの定義や修正に使用します。

source: MenuFileExit(*) ; User chose "Exit" from the File menu.
ja: MenuFileExit(*) ; ユーザーはファイルメニューから 「Exit」を選択しました。

source: MenuFileNew() ; Apply default settings.
ja: MenuFileNew() ; デフォルトの設定を適用します。

source: MenuFromHandle - Syntax & Usage | AutoHotkey v2
ja: MenuFromHandle - 構文と使用法｜AutoHotkey v2

source: MenuGetHandle (use Menu.Handle)
ja: MenuGetHandle（Menu.Handleを使用します）

source: MenuGetName (there are no menu names; MenuFromHandle is the closest replacement)
ja: MenuGetName（メニュー名がないため、MenuFromHandleが最も近い代替となる）

source: MenuSelect - Syntax & Usage | AutoHotkey v2
ja: MenuSelect - 構文と使用法｜AutoHotkey v2

source: Menus.Add "&File", FileMenu ; Attach the two submenus that were created above.
ja: Menus.Add "&File", FileMenu ; 上記で作成した2つのサブメニューを添付する。

source: Message
ja: メッセージ

source: Message Check Interval
ja: メッセージチェックの間隔

source: Messages sent (not posted) by the script's own process to itself cannot be delayed or buffered.
ja: スクリプトの自プロセスが自分自身に送信する（投稿しない）メッセージは、遅延やバッファリングができません。

source: Messages sent to a control (rather than being posted) are not monitored because the system routes them directly to the control behind the scenes.
ja: コントロールに送信されたメッセージは（投稿されるのではなく）、システムが裏でコントロールに直接ルーティングするため、監視されることはありません。

source: Meta-Functions
ja: メタファンクション

source: Meta-functions are not called in the following cases:
ja: メタファンクションは以下の場合には呼び出されない：

source: Meta-functions define what happens when an undefined property or method is invoked.
ja: メタファンクションは、未定義のプロパティやメソッドが呼び出されたときに何が起こるかを定義します。

source: Meta-functions receive the property name as a parameter, so are a good solution to this problem.
ja: メタ・ファンクションはプロパティ名をパラメータとして受け取るので、この問題に対する良い解決策となる。

source: Meta-functions were greatly simplified; they act like normal methods:
ja: メタファンクションが大幅に簡略化され、通常のメソッドと同じように動作するようになりました：

source: Method #1
ja: 方法 #1

source: Method #2
ja: 方法 #2

source: Method #3
ja: 方法 #3

source: Method and property parameters are passed as an Array.
ja: メソッドやプロパティのパラメータは、Arrayとして渡されます。

source: Method call statements (method calls which omit parentheses) are restricted to a plain variable followed by one or more identifiers separated by dots, such as MyVar.MyProperty.MyMethod "String to pass".
ja: メソッド呼び出し文（括弧を省略したメソッド呼び出し）は、MyVar.MyProperty.MyMethod "String to pass" のように、プレーン変数の後にドットで区切られた1つまたは複数の識別子を持つものに限定されます。

source: Method calls such as MyObj.MyMethod().
ja: MyObj.MyMethod()のようなメソッド呼び出しです。

source: Method definitions look identical to function definitions.
ja: メソッド定義は関数定義と同じように見える。

source: Methods
ja: メソッド

source: Methods are defined by properties, unlike v2.0-a104 to v2.0-a127, where they are separate to properties.
ja: メソッドは、v2.0-a104からv2.0-a127までと異なり、プロパティに分離して定義されています。

source: Methods are typically excluded from enumeration in the two-parameter mode, because evaluation of the property normally depends on whether the object has a corresponding getter or value, either in the same object or a base object.
ja: なぜなら、プロパティの評価は、通常、オブジェクトに対応するゲッターや値があるかどうか（同じオブジェクトかベースオブジェクトのいずれか）に依存するからです。

source: Methods can still be created by assigning new value properties, which generally act as in v1.
ja: メソッドは、一般的にv1のように動作する新しい値プロパティを割り当てることによって、まだ作成することができます。

source: Methods implemented this way cannot be detected and may not even have a corresponding function object, so are not supported by GetMethod.
ja: この方法で実装されたメソッドは検出できず、対応する関数オブジェクトもない可能性があるため、GetMethodではサポートされません。

source: Methods in ITaskbarList's VTable:
ja: ITaskbarListのVTableにあるメソッドです：

source: Methods may be defined through one of the following:
ja: メソッドは、以下のいずれかによって定義することができる：

source: Methods of sending keystrokes and mouse clicks with a controller.
ja: コントローラでキーストロークやマウスクリックを送信する方法。

source: Methods: Add, AddStandard, Check, Delete, Disable, Enable, Insert, Rename, SetColor, SetIcon, Show, ToggleCheck, ToggleEnable, Uncheck.
ja: メソッド：Add、AddStandard、Check、Delete、Disable、Enable、Insert、Rename、SetColor、SetIcon、Show、ToggleCheck、ToggleEnable、Uncheck。

source: Microphone (Example HD Audio)
ja: マイク（HDオーディオの例）

source: Microphone, FrontMic, Line In, and Side.
ja: マイク、フロントマイク、ライン入力、サイド。

source: Microsoft Defender SmartScreen may show a prompt like "Windows protected your PC".
ja: Microsoft Defender SmartScreenで「WindowsがあなたのPCを保護しました」のようなプロンプトが表示される場合があります。

source: Microsoft Docs does not show the numeric value of each notification code; those can be found in the Windows SDK or by searching the Internet.
ja: Microsoft Docsには、各通知コードの数値は掲載されていませんので、Windows SDKやインターネットで検索してご確認ください。

source: Microsoft can assign an effect to an unassigned key code at any time.
ja: マイクロソフトは、未割り当てのキーコードにいつでもエフェクトを割り当てることができます。

source: Microsoft documentation usually lists methods in alphabetical order, which is not relevant.
ja: マイクロソフトのドキュメントでは、通常、メソッドをアルファベット順に記載していますが、これは関係ありません。

source: Microsoft's documentation is unclear about the details of this timeout, but research indicates the following for Windows 7 and later:
ja: このタイムアウトの詳細についてはマイクロソフトのドキュメントでは不明ですが、調査によるとWindows 7以降では以下のようになるようです。

source: Microsoft's documentation is unclear about the details of this timeout, but research indicates the following for Windows 7 and later: If LowLevelHooksTimeout is not defined, the default timeout is 300 ms.
ja: このタイムアウトの詳細についてはマイクロソフトのドキュメントでは不明ですが、調査によるとWindows 7以降では以下のようになるようです：LowLevelHooksTimeoutが定義されていない場合、デフォルトのタイムアウトは 300 ms です。

source: Microsoft's own interface definitions are accompanied by this plain-C definition of the interface's virtual function table, which lists all methods explicitly, in the correct order.
ja: Microsoft独自のインターフェース定義には、インターフェースの仮想関数テーブルのこのプレーンC定義が付属しており、すべてのメソッドを正しい順序で明示的にリストアップしています。

source: Middle or wheel mouse button
ja: 中ボタンまたはホイールボタン

source: Middle-click to copy the link address.":true,
ja: Middle-click to copy the link address.":"デフォルトのブラウザでこのドキュメントを開きます（インターネット接続が必要です）。中クリックしてリンクアドレスをコピーする。",

source: Might indicate unformatted/RAW file system.
ja: RAWファイルシステムが未フォーマットであることを示す可能性があります。

source: Minimize Window to Tray Menu
ja: ウィンドウをトレイメニューに最小化する

source: Minimizes all windows for 1 second and unminimizes them.
ja: 全てのウィンドウを1秒間最小化し、最小化を解除します。

source: Minimizes or unminimizes all windows.
ja: 全てのウィンドウを最小化または最小化を解除します。

source: Minimizes the window and activates the one beneath it.
ja: ウィンドウを最小化し、その下のウィンドウをアクティブにします。

source: Minimizing the main window causes it to automatically be hidden.
ja: メインウィンドウを最小化すると、自動的に非表示になります。

source: Minimum tracking width and height of a window, in pixels.
ja: ウィンドウの最小トラッキング幅と高さをピクセル単位で示す。

source: Minimum width and height of a window, in pixels.
ja: ウィンドウの最小の幅と高さをピクセル単位で示す。

source: Minutes with leading zero (00 – 59)
ja: 分（先頭のゼロあり）（00～59）

source: Minutes without leading zero (0 – 59)
ja: 分（先頭のゼロなし）（0～59）

source: Misc.
ja: その他

source: Misc:
ja: その他

source: Misc: A_Clipboard, A_Cursor, A_EventInfo, (...more...)
ja: その他：A_Clipboard、A_Cursor、A_EventInfo、(...もっと...)

source: Miscellaneous
ja: その他

source: Miscellaneous topics
ja: その他のトピックス

source: Missing parameters are also inserted, but without a value.
ja: 欠落したパラメータも挿入されるが、値はない。

source: Mixed assignment
ja: 混合課題

source: Mode 1 (Position):
ja: モード1（ポジション）です。

source: Mode 2 (Control):
ja: モード2（コントロール）です。

source: Modes and options
ja: モードとオプション

source: Modified Commands, Functions & Directives
ja: 修正されたコマンド、関数、指令

source: Modified Commands/Functions
ja: 変更されたコマンド/ファンクション

source: Modified keystrokes such as Ctrl+A through Ctrl+Z are recognized and transcribed if they correspond to real ASCII characters.
ja: Ctrl+A からCtrl+Zのような修飾されたキー操作は、実際のASCII文字に対応する場合に認識され、転写されます。

source: Modifier Keys
ja: 修飾キー

source: Modifier keys are restored differently to allow a Send to turn off a hotkey's modifiers even if the user is still physically holding them down.
ja: 修飾キーは、ユーザーが物理的に押したままでも、センドがホットキーの修飾をオフにできるように、別の方法で復元されます。

source: Modifies the attributes and/or name of an item, and returns the item's own ID.
ja: アイテムの属性や名前を変更し、そのアイテム自身の ID を返す。

source: Modifies the attributes and/or name of an item.
ja: アイテムの属性や名前を変更する。

source: Modifies the attributes and/or text of a row.
ja: 行の属性やテキストを変更する。

source: Modifies the attributes and/or text of the specified column and its header.
ja: 指定されたカラムとそのヘッダーの属性とテキストを変更します。

source: Modifying the returned object has no effect on Obj unless DefineProp is called.
ja: 返されたオブジェクトを変更しても、DefinePropが呼び出されない限り、Objには何の影響もない。

source: Modular code is usually easier to test, understand and maintain.
ja: モジュール化されたコードは、通常、テスト、理解、保守が容易です。

source: Modulo.
ja: モジュロ。

source: Monitor Functions
ja: Monitor関数

source: MonitorGet - Syntax & Usage | AutoHotkey v2
ja: MonitorGet - 構文と使用法｜AutoHotkey v2

source: MonitorGetCount - Syntax & Usage | AutoHotkey v2
ja: MonitorGetCount - 構文と使用法｜AutoHotkey v2

source: MonitorGetName - Syntax & Usage | AutoHotkey v2
ja: MonitorGetName - 構文と使用法｜AutoHotkey v2

source: MonitorGetPrimary - Syntax & Usage | AutoHotkey v2
ja: MonitorGetPrimary - 構文と使用法｜AutoHotkey v2

source: MonitorGetWorkArea - Syntax & Usage | AutoHotkey v2
ja: MonitorGetWorkArea - 構文と使用法｜AutoHotkey v2

source: Monitors mouse clicks in a GUI window.
ja: GUIウィンドウのマウスクリックを監視する。

source: Monitors the active window and displays the position of its vertical scroll bar in its focused control (with real-time updates).
ja: アクティブなウィンドウを監視し、その垂直スクロールバーの位置をフォーカスコントロールに表示します（リアルタイムに更新されます）。

source: Month with leading zero (01 – 12)
ja: 月（先頭のゼロなし）（01～12）

source: Month without leading zero (1 – 12)
ja: 月（先頭のゼロなし）（1～12）

source: MonthCal Control Styles
ja: MonthCalコントロールのスタイル

source: More About Locals and Globals
ja: ローカルとグローバルの詳細

source: More DirectX issues may occur when using PixelSearch, PixelGetColor or ImageSearch.
ja: PixelSearch、PixelGetColor、ImageSearchを使用すると、さらにDirectXの問題が発生する可能性があります。

source: More about locals and globals
ja: ローカルとグローバルの詳細

source: More direct methods tend to work only in particular types of app.
ja: より直接的な方法は、特定のタイプのアプリにのみ有効な傾向があります。

source: More structure examples:
ja: その他の構造例：

source: Most (but not all) examples can be executed as-is to demonstrate their effect.
ja: ほとんどの例（すべてではない）は、そのまま実行することでその効果を発揮することができます。

source: Most callbacks in 32-bit programs use the stdcall calling convention, which requires a fixed number of parameters.
ja: 32ビットプログラムのほとんどのコールバックは、固定数のパラメータを必要とするstdcall呼び出し規約を使用しています。

source: Most characters like abc123 can be used literally inside a regular expression.
ja: abc123 のようなほとんどの文字は、正規表現の中で文字通り使用することができます。

source: Most control types use carriage return and linefeed (`r`n) rather than a solitary linefeed (`n) to mark the end of each line.
ja: ほとんどのコントロールタイプでは、各行の終わりを示すために、単独のラインフィード（`n）ではなく、キャリッジリターンとラインフィード（`r`n）を使用します。

source: Most controls do not need this because they already have a type-specific border.
ja: ほとんどのコントロールは、すでにタイプ固有のボーダーを持っているため、これは必要ありません。

source: Most drives cannot be "locked open".
ja: ほとんどのドライブは「ロックオープン」することができません。

source: Most expressions with side-effects can be used this way, so it is generally not necessary to memorise the details of this section.
ja: 副作用のある表現のほとんどはこの方法で使えるので、一般にこの項の詳細を覚える必要はない。

source: Most functions still expect null-terminated strings, so will only "see" up to the first binary zero.
ja: ほとんどの関数はまだヌル終端文字列を想定しているので、最初の2進数のゼロまでしか「見えない」のです。

source: Most members -- such as DWORD, Int, and other types of 32-bit integers -- are 4 bytes in size.
ja: DWORD、Intなどの32ビット整数のようなほとんどのメンバーは、4バイトのサイズです。

source: Most members tend to be integers.
ja: ほとんどのメンバーが整数になる傾向があります。

source: Most non-executable files (and even some EXEs) have no version, and thus an error will be thrown.
ja: ほとんどの実行不可能なファイル（および一部のEXEファイル）はバージョンを持たないため、エラーをスローします。

source: Most of this tutorial is about ways to identify which window you want to operate on, since that is often the most troublesome part.
ja: このチュートリアルの大部分は、操作するウィンドウを特定する方法に関するものです（これが最も面倒な部分だからです）。

source: Most probably a mouse click at the toolbar button, right?
ja: おそらく、ツールバーのボタンをマウスでクリックしたんだろう？

source: Most programs interpret quote marks as a sort of toggle, switching modes between "space ends the parameter" and "space is included in the parameter".
ja: ほとんどのプログラムは、引用符を一種のトグルとして解釈し、「スペースはパラメーターを終了する」と「スペースはパラメーターに含まれる」の間でモードを切り替えます。

source: Most scripts have an effect only while they are running.
ja: ほとんどのスクリプトは、実行中にのみ効果を発揮する。

source: Most such errors can be easily corrected once they are identified.
ja: このようなエラーの多くは、一度確認すれば簡単に修正することができます。

source: Most users will not be debugging remotely, and therefore may simply put a checkmark next to Bypass all mapping (local windows setup).
ja: ほとんどのユーザーはリモートでデバッグすることはないので、「Bypass all mapping (local windows setup)」にチェックマークを付けるだけでよいでしょう。

source: Most window functions allow the window title (and related parameters) to be omitted, and will in that case default to the last found window.
ja: ほとんどのウィンドウ関数では、ウィンドウのタイトル（および関連するパラメータ）を省略することができ、その場合、最後に見つかったウィンドウをデフォルトとして使用します。

source: Mouse
ja: マウス

source: Mouse Remapping
ja: マウスリマッピング

source: Mouse Wheel Hotkeys
ja: マウスホイールホットキー

source: Mouse hotkeys may send the mask key immediately if the keyboard hook is not installed.
ja: マウスホットキーは、キーボードフックが装着されていない場合、マスクキーを即座に送信する場合があります。

source: Mouse hotkeys which use the Alt modifier (such as !LButton::) can suppress the window menu more efficiently, by sending only one menu mask key when the Alt key is released, instead of sending one each time the button is clicked.
ja: Alt修飾子を使用するマウスホットキー（!LButton::など）は、ボタンをクリックするたびに1つのメニューマスクキーを送信するのではなく、Altキーを離したときに1つだけ送信することにより、ウィンドウメニューをより効率的に抑制できます。

source: Mouse wheel hotkeys set A_EventInfo to the wheel delta as reported by the mouse driver instead of dividing by 120.
ja: マウスホイールのホットキーで、A_EventInfoを120で割るのではなく、マウスドライバーから報告されたホイールデルタに設定します。

source: MouseClick "left",,, 1, 0, "D" ; Hold down the left mouse button.
ja: MouseClick "left",,, 1, 0, "D" ; マウスの左ボタンを押したままにします。

source: MouseClick "left",,, 1, 0, "U" ; Release the mouse button.
ja: MouseClick "left",,, 1, 0, "U" ; マウスボタンを離す。

source: MouseClick - Syntax & Usage | AutoHotkey v2
ja: MouseClick - 構文と使用法｜AutoHotkey v2

source: MouseClickDrag - Syntax & Usage | AutoHotkey v2
ja: MouseClickDrag - 構文と使用法｜AutoHotkey v2

source: MouseGetPos - Syntax & Usage | AutoHotkey v2
ja: MouseGetPos - 構文と使用法｜AutoHotkey v2

source: MouseMove - Syntax & Usage | AutoHotkey v2
ja: MouseMove - 構文と使用法｜AutoHotkey v2

source: MouseMove 0, 0 ; Prevents the status bar from showing a mouse-hover link instead of "Done".
ja: MouseMove 0, 0 ; ステータスバーに 「Done」の代わりにマウスホバーリンクが表示されないようにします。

source: Moves a directory to a new drive.
ja: ディレクトリを新しいドライブに移動します。

source: Moves a file without renaming it.
ja: ファイル名を変更せずに、ファイルを移動します。

source: Moves a folder along with all its sub-folders and files.
ja: フォルダを、そのサブフォルダやファイルとともに移動します。

source: Moves all files and folders inside a folder to a different folder.
ja: フォルダー内のすべてのファイルやフォルダーを別のフォルダーに移動します。

source: Moves and/or resizes the GUI window.
ja: GUIウィンドウを移動またはサイズ変更します。

source: Moves and/or resizes the control.
ja: コントロールの移動およびサイズ変更を行います。

source: Moves and/or resizes the window.
ja: ウィンドウを移動またはサイズ変更します。

source: Moves or renames one or more files.
ja: 1つまたは複数のファイルを移動または名前変更します。

source: Moves or resizes a control.
ja: コントロールを移動またはサイズ変更します。

source: Moves text files to a new location and gives them a new extension.
ja: テキストファイルを新しい場所に移動し、新しい拡張子を付与します。

source: Moves the file pointer.
ja: ファイルポインタを移動します。

source: Moves the mouse cursor slowly (speed 50 vs. 2) by 20 pixels to the right and 30 pixels down from its current location.
ja: マウスカーソルを現在位置から右に20ピクセル、下に30ピクセルだけゆっくり移動させます（速度50対2）。

source: Moves the mouse cursor to a new position.
ja: マウスカーソルを新しい位置に移動します。

source: Moves the mouse cursor to a specific position without clicking.
ja: クリックせずに、マウスカーソルを特定の位置に移動させます。

source: Moves the mouse cursor to a specific position, then right-clicks once.
ja: マウスカーソルを特定の位置に移動させ、右クリックを1回します。

source: Moves the mouse cursor.
ja: マウスカーソルを移動させます。

source: Moving the Mouse Cursor via the Keyboard
ja: キーボードによるマウスカーソルの移動

source: MsgBox second ; Normal (single) variable reference => target
ja: MsgBox second ; 通常の（単一の）変数の参照⇒ターゲット

source: MsgBox "A_Index = " A_Index ; This will display only the numbers 20 through 25
ja: MsgBox "A_Index = " A_Index ; 20から25までの数字だけを表示します。

source: MsgBox "Iteration number is " A_Index ; A_Index will be 1, 2, then 3
ja: MsgBox "反復番号は " A_Index ; A_Index は 1, 2, そして 3の順になります。

source: MsgBox "The X coordinate is " x ".
ja: MsgBox "X座標は" x ".

source: MsgBox "The string was found."
ja: MsgBox "文字列が見つかりました。"

source: MsgBox "The string was not found."
ja: MsgBox "文字列が見つかりません。"

source: MsgBox "The text is:`n" WinGetText() ; Use the window found by WinWait.
ja: MsgBox "The text is:`n" WinGetText() ; WinWait関数で見つかったウィンドウが対象となります。

source: MsgBox %second% ; Double-deref => 42
ja: MsgBox %second% ; ダブルデフ⇒42

source: MsgBox - Syntax & Usage | AutoHotkey v2
ja: MsgBox - 構文と使用法｜AutoHotkey v2

source: MsgBox 0.1 + 0.2 = 0.3 ; 0 (not equal)
ja: MsgBox 0.1 + 0.2 = 0.3 ; 0（ノットイコール）

source: MsgBox ACos(0.2) ; Returns 1.369438
ja: MsgBox ACos(0.2) ; 1.369438を返します。

source: MsgBox ASin(0.2) ; Returns 0.201358
ja: MsgBox ASin(0.2) ; 0.201358を返します。

source: MsgBox ATan(1.2) ; Returns 0.876058
ja: MsgBox ATan(1.2) ; 0.876058を返します。

source: MsgBox Ceil(-1.2) ; Returns -1
ja: MsgBox Ceil(-1.2) ; -1 を返します。

source: MsgBox Ceil(1.2) ; Returns 2
ja: MsgBox Ceil(1.2) ; 2を返します。

source: MsgBox ControlGetText("Edit1") ; Use the window found above.
ja: MsgBox ControlGetText("Edit1") ; 上の行で見つかったウィンドウを使用します。.

source: MsgBox Cos(1.2) ; Returns 0.362358
ja: MsgBox Cos(1.2) ; 0.362358を返します。

source: MsgBox DateDiff(var1, var2, "days") ; The answer will be 366 since 2004 is a leap year.
ja: MsgBox DateDiff(var1, var2, "days") ; 2004年はうるう年なので、戻り値は366です。

source: MsgBox Exp(1.2) ; Returns 3.320117
ja: MsgBox Exp(1.2) ; 3.320117を返す。

source: MsgBox Floor(-1.2) ; Returns -2
ja: MsgBox Floor(-1.2) ; -2 を返します。

source: MsgBox Floor(1.2) ; Returns 1
ja: MsgBox Floor(1.2) ; 1を返します。

source: MsgBox Format("vk{:X}", vk_code) ; Reports vk1B
ja: MsgBox Format("vk{:X}", vk_code) ; vk1Bの報告。

source: MsgBox GetKeyName("Esc") ; Shows Escape
ja: MsgBox GetKeyName("Esc") ; Escapeと表示します。

source: MsgBox GetKeyName("vk1B") ; Shows also Escape
ja: MsgBox GetKeyName("vk1B") ; 同じくEscapeと表示します。

source: MsgBox InStr("123abc789", "abc") ; Returns 4
ja: MsgBox InStr("123abc789", "abc") ; 4を返します。

source: MsgBox InStr(Haystack, Needle, false, 1, 2) ; case-insensitive search, return start position of second occurence
ja: MsgBox InStr(Haystack, Needle, false, 1, 2) ; 大文字小文字を区別しないで検索し、先頭から検索して2番目に出現した場所を返します。

source: MsgBox InStr(Haystack, Needle, true) ; case-sensitive search, return start position of first occurence, same result as above
ja: MsgBox InStr(Haystack, Needle, true) ; 大文字小文字を区別して検索し、先頭から検索して最初に出現した場所を返します。上の結果と同じです。

source: MsgBox Ln(1.2) ; Returns 0.182322
ja: MsgBox Ln(1.2) ; 0.182322を返す。

source: MsgBox Log(1.2) ; Returns 0.079181
ja: MsgBox Log(1.2) ; 0.079181を返す。

source: MsgBox Max(2.11, -2, 0) ; Returns 2.11
ja: MsgBox Max(2.11, -2, 0) ; 2.11を返します。

source: MsgBox Max(Numbers*) ; Returns 4
ja: MsgBox Max(Numbers*) ; 4を返す。

source: MsgBox Min(2.11, -2, 0) ; Returns -2
ja: MsgBox Min(2.11, -2, 0) ; 戻り値 -2

source: MsgBox Min(Numbers*) ; Returns 1
ja: MsgBox Min(Numbers*) ; 1を返します。

source: MsgBox Mod(7.5, 2) ; Returns 1.5 (2 x 3 + 1.5)
ja: MsgBox Mod(7.5, 2) ; 1.5 (2 x 3 + 1.5) を返します。

source: MsgBox MyArray%A_Index% ; Shows A, then B, then C.
ja: MsgBox MyArray%A_Index% ; Aを表示し、次にBを表示し、次にCを表示します。

source: MsgBox MyVar ; Reports "0 test".
ja: MsgBox MyVar ; 「0 test」と表示されます。

source: MsgBox Output ; Display the information accumulated by the callback.
ja: MsgBox Output ; コールバックで蓄積された情報を表示します。

source: MsgBox Round(3.14) ; Returns 3
ja: MsgBox Round(3.14) ; 3を返します。

source: MsgBox Round(3.14, 1) ; Returns 3.1
ja: MsgBox Round(3.14, 1) ; 3.1を返します。

source: MsgBox Round(345, -1) ; Returns 350
ja: MsgBox Round(345, -1) ; 350を返します。

source: MsgBox Round(345, -2) ; Returns 300
ja: MsgBox Round(345, -2) ; 300を返します。

source: MsgBox Sin(1.2) ; Returns 0.932039
ja: MsgBox Sin(1.2) ; 0.932039を返します。

source: MsgBox Sqrt(16) ; Returns 4
ja: MsgBox Sqrt(16) ; 4が返ります。

source: MsgBox StrGet(bufW, "UTF-16") ; Or just StrGet(bufW).
ja: MsgBox StrGet(bufW, "UTF-16") ; あるいは、StrGet(bufW)だけです。

source: MsgBox Tan(1.2) ; Returns 2.572152
ja: MsgBox Tan(1.2) ; 2.572152を返します。

source: MsgBox Var ; Same as above.
ja: MsgBox Var ; 上と同じです。

source: MsgBox g ; Without the declaration, the above assigned to a local "g".
ja: MsgBox g ; 宣言がない場合、上記はローカルな「g」に割り当てられる。

source: MsgBox in v1.0 and v1.1 had "smart comma handling" to avoid the need to escape commas in unquoted text.
ja: v1.0とv1.1のMsgBoxは、引用符のないテキストでカンマをエスケープする必要がないように、「スマートカンマ処理」を採用していました。

source: MsgBox returnTest() ; Shows 123
ja: MsgBox returnTest() ; 123と表示します。

source: MsgBox the_language ; Display the language name.
ja: MsgBox the_language ; 取得した言語名を表示します。

source: MsgBox type(inner) ; Displays "Func"
ja: MsgBox type(inner) ; 「Func」と表示されます。

source: MsgBox x ; x causes this to become a closure.
ja: MsgBox x ; x はクロージャになる。

source: MsgBox x ; Displays "outer value"
ja: MsgBox x ; 「outer value」を表示する

source: MsgBox's handles commas more consistently
ja: MsgBoxの方がカンマの扱いが安定している

source: MsgBox(0x7F) ; Shows 128
ja: MsgBox(0x7F) ; 128と表示します。

source: MsgBox(1.00) ; Shows 1.0
ja: MsgBox(1.00) ; 1.0と表示します。

source: MsgBox(A && B && ++C && D && E) ; Shows "" (B).
ja: MsgBox(A && B && ++C && D && E) ; "" (B)と表示します。

source: MsgBox(A && B && C && D && E) ; Shows "str" (E).
ja: MsgBox(A && B && C && D && E) ; "str" (E)と表示します。

source: Multi-character time marker, such as AM or PM (depends on locale)
ja: AMやPMなどの長い午前午後を表す記号（ロケールによります）

source: Multi-dimension array hacks were removed.
ja: 多次元配列のハックを削除しました。

source: Multi-line hotkeys without braces or a function definition.
ja: 中括弧や関数定義のない複数行のホットキー。

source: Multi-select.
ja: マルチセレクトです。

source: Multimedia Keys
ja: マルチメディア キー

source: Multiple Catch statements can be used one after the other, with each one specifying a different class (or multiple classes).
ja: 複数のCatch文は、それぞれ異なるクラス（または複数のクラス）を指定して、次々に使用することができます。

source: Multiple catch statements can be used one after the other, with each one specifying a different class (or multiple classes).
ja: 複数のcatch文は、それぞれ異なるクラス（または複数のクラス）を指定して、次々に使用することができます。

source: Multiple Criteria
ja: 複数の基準

source: Multiple InputHooks can be used in combination with MinSendLevel to separately collect both sent keystrokes and real ones.
ja: 複数のInputHooksをMinSendLevelと組み合わせて使用することで、送信されたキーストロークと実際のキーストロークの両方を個別に収集することができます。
